In [15]:
#Outliers

In [16]:
#extremely high or extremely low values

In [1]:
import pandas as pd


# Create the DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Emily', 'Frank', 'Grace', 'Outlier1', 'Outlier2'],
    'Salary': [10, 15, 20, 25, 30, 35, 40, 5, 50]
}

df = pd.DataFrame(data)

# Display the DataFrame
print(df)

       Name  Salary
0     Alice      10
1       Bob      15
2   Charlie      20
3     David      25
4     Emily      30
5     Frank      35
6     Grace      40
7  Outlier1       5
8  Outlier2      50

In [3]:
df.columns

Index(['Name', 'Salary'], dtype='object')

In [5]:
import numpy as np

In [7]:
p25=df['Salary'].quantile(0.25)

In [8]:
p25

15.0

In [22]:
import pandas as pd

# Create the DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Emily', 'Frank', 'Grace', 'suresh', 'lokesh'],
    'Height': [5.2, 5.6, 5.9, 6.1, 5.5, 6.0, 5.8, 4.5, 7.0]  # Heights in feet
}

# Convert data to DataFrame
df = pd.DataFrame(data)

# Display the DataFrame
print(df)

      Name  Height
0    Alice     5.2
1      Bob     5.6
2  Charlie     5.9
3    David     6.1
4    Emily     5.5
5    Frank     6.0
6    Grace     5.8
7   suresh     4.5
8   lokesh     7.0

In [23]:
df

      Name  Height
0    Alice     5.2
1      Bob     5.6
2  Charlie     5.9
3    David     6.1
4    Emily     5.5
5    Frank     6.0
6    Grace     5.8
7   suresh     4.5
8   lokesh     7.0

In [32]:
#sorting the values

df.sort_values(by='Height')

      Name  Height
7   suresh     4.5
0    Alice     5.2
4    Emily     5.5
1      Bob     5.6
6    Grace     5.8
2  Charlie     5.9
5    Frank     6.0
3    David     6.1
8   lokesh     7.0

In [38]:
max_treshold=df['Height'].quantile(0.95)

In [39]:
max_treshold

6.64

In [58]:
min_treshold=df['Height'].quantile(0.35)

In [59]:
min_treshold

5.58

In [61]:
max_outlier
min_outlier

     Name  Height
0   Alice     5.2
4   Emily     5.5
7  suresh     4.5